<template>
    <div class="d-flex flex-column gap10" v-if="props.propsTextBox == 0">
        <div>
            <img src="~/assets/images&icons/langingPage/imagesAboutUs/imageSanam.png" alt="">
        </div>
        <h2 class="text-h4"><span class="activeTitle">سنــام</span> منصة شاملة متخصصة في رعاية الإبل</h2>
        <p>سـنام منصة شاملة متخصصة في رعاية الإبل نوفِّر خدمات ومنتجات متميزة لتلبية احتياجات عملائنا، ونقدِّم
            معلومات شاملة ومفيدة لتعزيز الوعي بالإبل ومواكبة الأحداث والفعاليات المتعلقة بها. يتميز مشروعنا بتركيزنا
            على دمج التراث العربي المرتبط بالإبل بالتقنيات الحديثة، لتحقيق التوازن بين الحفاظ على التراث وتطوير مجال
            رعاية الإبل بشكل مستدام ومبتكر.</p>
    </div>
    <div v-for="forLlopCardText in forLlopCardTexts" :key="forLlopCardText">
        <div class="containerNavbar" v-if="props.propsTextBox == forLlopCardText.idCard">
            <div class="d-flex flex-column gap10 text-center">
                <h2 class="text-h4">{{ forLlopCardText.titleCard }}</h2>
                <h2 class="textNavbar">{{ forLlopCardText.titleTowCard }}</h2>
                <p class="mt-4">{{ forLlopCardText.textCard }}</p>
            </div>
        </div>
    </div>
</template>

<script setup>
const props = defineProps({
    propsTextBox: Number
});

const forLlopCardTexts = ref([
    {
        idCard: '1', titleCard: 'عالم الإبل', titleTowCard: 'في قلب الصحراء، تتألق جوهرة الصمود والقوة في العالم العربي', textCard: 'الإبل تحمل في ثناياها روح التراث العربي العريق وتاريخه المجيد. تعزز الاقتصاد وترسخ الثقافة والهوية العربية، وتعكس قيم الكرامة والضيافة التي تتجذر في تقاليدنا الأصيلة.حفظ تراث الإبل يعد اهتمامًا بحفظ أصالة العرب وتراثهم العريق.فتلك الجوهرة الثمينة تستحق أن الاهتمام والعناية لتستمر في تجسيد معانيها العميقة وروعتها في قلوبنا.'
    },
    {
        idCard: '2', titleCard: 'لوازم الإبل', titleTowCard: 'عالمًا من الراحة والتميز لشريكك الثمين', textCard: 'ندرك أن للإبل احتياجات عديدة ومستلزمات لا غنى عنها. ومن هنا نسعى جاهدين لتلبية تلك الاحتياجات بأفضل جودة وأعلى معايير.ونوفر مجموعة واسعة من لوازم الإبل بدءًا من الأعلاف المغذية وصولاً إلى المعدات والأدوات الضرورية لرعايتها بأسعار مناسبة ومنافسة لتحقيق أفضل قيمة ممكنة لمالكي الإبل.'
    },
    {
        idCard: '3', titleCard: 'خدمات الإبل', titleTowCard: 'عالمًا من الراحة والتميز لشريكك الثمين', textCard: 'ندرك الأهمية الكبيرة التي تحملها الإبل ونسعى جاهدين للحفاظ على هذا التراث الثمين كونها شريك ذو قيمة تاريخية وثقافية لا تضاهى. يقدم فريقنا المختص خدمات شاملة مثل الرعاية الصحية والتغذية المتوازنة وعمليات النقل، ونحرص على صحة وسلامة الإبل باستخدام أحدث التقنيات والمعايير العالية، لضمان تقديم أفضل الخدمات التي تستحقها.'
    }
])
</script>