<template>
    <div class="containerNavbar" v-if="props.propsTextBox == 0">
        <div class="d-flex flex-column gap10 text-center">
            <h2 class="text-h4">عالم الإبل</h2>
            <h2 class="textNavbar">في قلب الصحراء، تتألق جوهرة الصمود والقوة في العالم العربي</h2>
            <p class="mt-5 pt-2">الإبل تحمل في ثناياها روح التراث العربي العريق وتاريخه المجيد. تعزز الاقتصاد وترسخ
                الثقافة والهوية العربية، وتعكس قيم الكرامة والضيافة التي تتجذر في تقاليدنا الأصيلة. حفظ تراث الإبل يعد
                اهتمامًا بحفظ أصالة العرب وتراثهم العريق. فتلك الجوهرة الثمينة تستحق أن الاهتمام والعناية لتستمر في
                تجسيد معانيها العميقة وروعتها في قلوبنا.</p>
        </div>
    </div>
    <div class="containerNavbar" v-if="props.propsTextBox == 1">
        <div class="d-flex flex-column gap10 text-center">
            <h2 class="text-h4">لـــوازم الإبـــل</h2>
            <h2 class="textNavbar">عالمًا من الراحة والتميز لشريكك الثمين</h2>
            <p class="mt-5 pt-2">ندرك أن للإبل احتياجات عديدة ومستلزمات لا غنى عنها. ومن هنا نسعى جاهدين لتلبية تلك
                الاحتياجات بأفضل جودة وأعلى معايير. ونوفر مجموعة واسعة من لوازم الإبل بدءًا من الأعلاف المغذية وصولاً
                إلى المعدات والأدوات الضرورية لرعايتها بأسعار مناسبة ومنافسة لتحقيق أفضل قيمة ممكنة لمالكي الإبل.</p>
        </div>
    </div>
</template>

<script setup>
const props = defineProps({
    propsTextBox: Number
});
</script>